app/views/articles/index.html.erb

        <td class='text-table'><%= article.down_votes%></td>
        <td class='data-table'><%= "Author: #{article.author}, comments: #{article.comments.count}" %></td>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 4]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 9]]