app/controllers/articles_controller.rb

  def edit
    if params[:check].to_i == 1
      @article = Article.find(params[:id])
      if Vote.where(:voter => current_user.name, :article_id => @article.id ).blank?
        @article.votes.create(:voter => current_user.name)
        votes = @article.up_votes + 1
        @article.update_attribute(:up_votes, votes)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."article_id" = ? AND "id"."voter" = ? LIMIT ?  [["article_id", 13], ["voter", "p"], ["LIMIT", 1]]
INSERT INTO "votes" ("voter", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["voter", "p"], ["article_id", 13], ["created_at", 2017-04-29 19:45:35 UTC], ["updated_at", 2017-04-29 19:45:35 UTC]]
UPDATE "articles" SET "down_votes" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["down_votes", 19], ["updated_at", 2017-04-29 14:46:07 UTC], ["id", 11]]

  def up
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "author", "up_votes", "down_votes") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "asfasfas"], ["text", "afs"], ["created_at", 2017-04-29 14:09:44 UTC], ["updated_at", 2017-04-29 14:09:44 UTC], ["author", "p"], ["up_votes", 0], ["down_votes", 0]]