app/controllers/users_controller.rb

  def edit
    user = User.find_by_email(params[:email])
    puts "#{params[:email]}, #{params[:name]}, #{user.name}"

    if user && user.name == params[:name]
      if params[:password] == params[:password_confirmation]
        user.update_attribute(:password, params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "a"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$7GhgBHNPaAsDPTxgLfM1w.vbZDJsxuqUC1dcr3zLqLOOANPysxnQC"], ["updated_at", 2017-04-29 13:03:44 UTC], ["id", 5]]

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)